//
//		Character convert table
//			from UNICODE to BASICMASTER
//
#include	"common.h"

typedef	struct	{
		char	*from;
		char	*to;
		} pair_t;
pair_t table[] = {
			{"　",		"$20" },		// 全角スペース
			{"α",		"$10" },
			{"β",		"$11" },
			{"γ",		"$12" },
			{"η",		"$13" },
			{"θ",		"$14" },
			{"λ",		"$15" },
			{"μ",		"$16" },
			{"π",		"$17" },
			{"τ",		"$18" },
			{"φ",		"$19" },
			{"Φ",		"$19" },
			{"ψ",		"$1a" },
			{"Ψ",		"$1a" },
			{"ω",		"$1b" },
			{"Σ",		"$1c" },
			{"Ω",		"$1d" },
			{"χ",		"$1e" },
			{"÷",		"$1f" },
			{"➗",		"$1f" },
			{"￥",		"$5c" },
			{"■",		"$60" },
			{"←",		"$7b" },
			{"→",		"$7c" },
			{"↓",		"$7d" },
			{"↑",		"$7e" },
			{"┼",		"$80" },	// 罫線素片
			{"╋",		"$80" },
			{"└",		"$81" },
			{"┗",		"$81" },
			{"┘",		"$82" },
			{"┛",		"$82" },
			{"┐",		"$83" },
			{"┓",		"$83" },
			{"┌",		"$84" },
			{"┏",		"$84" },
			{"─",		"$85" },
			{"━",		"$85" },
			{"│",		"$86" },
			{"┃",		"$86" },
			{"✛",		"$87" },	// U+271B
//			{"+･",		"$87" },	// 2B U+FF65
			{"┤",		"$88" },
			{"┫",		"$88" },
			{"┬",		"$89" },
			{"┳",		"$89" },
			{"├",		"$8a" },
			{"┣",		"$8a" },
			{"┴",		"$8b" },
			{"┻",		"$8b" },
			{"╰",		"$8c" },
			{"╯",		"$8d" },
			{"╮",		"$8e" },
			{"╭",		"$8f" },
			{"〈",		"$90" },	// U+2329
			{"⌄",		"$91" },	// U+2304
			{"〉",		"$92" },	// U+232A
			{"⌃",		"$93" },	// U+2303
			{"◦",		"$94" },	// U+25E6
			{"○",		"$94" },	// U+25CB
			{"●",		"$95" },	// U+25CF
			{"♣",		"$96" },	// U+2663
			{"♧",		"$96" },	// U+2667
			{"♢",		"$97" },	// U+2662
			{"♦",		"$97" },	// U+2662
			{"♡",		"$98" },	// U+2661
			{"♥",		"$98" },	// U+2665
			{"♠",		"$99" },	// U+2660
			{"♤",		"$99" },	// U+2660
			{"出",		"$9a" },	// 漢字の「出」
			{"♪",		"$9b" },	// U+266A
			{"🐃",		"$9c" },	// U+1F403
			{"🐂",		"$9c" },	// U+1F402
			{"🐄",		"$9c" },	// U+1F404
			{"牛",		"$9c" },
			{"♞",		"$9c" },	// U+265E	// j68
			{"▒",		"$9d" },	// U+2592
			{"░",		"$9d" },	// U+2591
			{"▓",		"$9d" },	// U+2593
			{"家",		"$9e" },
			{"♟",		"$9e" },	// U+265F	// j68
			{"▲",		"$9e" },	// U+25B2
			{"\\",		"$9f" },
			{"﹨",		"$9f" },	// U+FE68
			{"。",		"$a1" },
			{"「",		"$a2" },
			{"」",		"$a3" },
			{"、",		"$a4" },
			{"・",		"$a5" },
			{"ヲ",		"$a6" },
			{"ァ",		"$a7" },
			{"ィ",		"$a8" },
			{"ゥ",		"$a9" },
			{"ェ",		"$aa" },
			{"ォ",		"$ab" },
			{"ャ",		"$ac" },
			{"ュ",		"$ad" },
			{"ョ",		"$ae" },
			{"ッ",		"$af" },
			{"ー",		"$b0" },
			{"ア",		"$b1" },
			{"イ",		"$b2" },
			{"ウ",		"$b3" },
			{"エ",		"$b4" },
			{"オ",		"$b5" },
			{"カ",		"$b6" },
			{"ガ",		"$b6,$de" },
			{"キ",		"$b7" },
			{"ギ",		"$b7,$de" },
			{"ク",		"$b8" },
			{"グ",		"$b8,$de" },
			{"ケ",		"$b9" },
			{"ゲ",		"$b9,$de" },
			{"コ",		"$ba" },
			{"ゴ",		"$ba,$de" },
			{"サ",		"$bb" },
			{"ザ",		"$bb,$de" },
			{"シ",		"$bc" },
			{"ジ",		"$bc,$de" },
			{"ス",		"$bd" },
			{"ズ",		"$bd,$de" },
			{"セ",		"$be" },
			{"ゼ",		"$be,$de" },
			{"ソ",		"$bf" },
			{"ゾ",		"$bf,$de" },
			{"タ",		"$c0" },
			{"ダ",		"$c0,$de" },
			{"チ",		"$c1" },
			{"ヂ",		"$c1,$de" },
			{"ツ",		"$c2" },
			{"ヅ",		"$c2,$de" },
			{"テ",		"$c3" },
			{"デ",		"$c3,$de" },
			{"ト",		"$c4" },
			{"ド",		"$c4,$de" },
			{"ナ",		"$c5" },
			{"ニ",		"$c6" },
			{"ヌ",		"$c7" },
			{"ネ",		"$c8" },
			{"ノ",		"$c9" },
			{"ハ",		"$ca" },
			{"バ",		"$ca,$de" },
			{"パ",		"$ca,$df" },
			{"ヒ",		"$cb" },
			{"ビ",		"$cb,$de" },
			{"ピ",		"$cb,$df" },
			{"フ",		"$cc" },
			{"ブ",		"$cc,$de" },
			{"プ",		"$cc,$df" },
			{"ヘ",		"$cd" },
			{"ベ",		"$cd,$de" },
			{"ペ",		"$cd,$df" },
			{"ホ",		"$ce" },
			{"ボ",		"$ce,$de" },
			{"ポ",		"$ce,$df" },
			{"マ",		"$cf" },
			{"ミ",		"$d0" },
			{"ム",		"$d1" },
			{"メ",		"$d2" },
			{"モ",		"$d3" },
			{"ヤ",		"$d4" },
			{"ユ",		"$d5" },
			{"ヨ",		"$d6" },
			{"ラ",		"$d7" },
			{"リ",		"$d8" },
			{"ル",		"$d9" },
			{"レ",		"$da" },
			{"ロ",		"$db" },
			{"ワ",		"$dc" },
			{"ン",		"$dd" },
			{"゛",		"$de" },
			{"゜",		"$df" },
			{"時",		"$e0" },
			{"分",		"$e1" },
			{"秒",		"$e2" },
			{"年",		"$e3" },
			{"月",		"$e4" },
			{"日",		"$e5" },
			{"火",		"$e6" },
			{"水",		"$e7" },
			{"木",		"$e8" },
			{"金",		"$e9" },
			{"土",		"$ea" },
			{"人",		"$eb" },
			{"点",		"$ec" },
			{"回",		"$ed" },
			{"文",		"$ee" },
			{"名",		"$ef" },
			{"▏",		"$f0" },	// U+258F
			{"▎",		"$f1" },	// U+258E
			{"▍",		"$f2" },	// U+258D
//			{"??",		"$f3" },
//			{"??",		"$f4" },
//			{"??",		"$f5" },
//			{"??",		"$f6" },
//			{"??",		"$f7" },
//			{"??",		"$f8" },
			{"▁",		"$f9" },	// U+2581
			{"▂",		"$fa" },	// U+2582
			{"▃",		"$fb" },	// U+2583
			{"／",		"$fb" },	// U+FF0F	// j68
			{"╱",		"$fc" },	// U+2571
			{"＼",		"$fd" },	// U+FF3C	// j68
			{"╲",		"$fd" },	// U+2572
			{"◆",		"$fe" },	// U+25c6	// j68
			{"⧓",		"$fe" },	// U+29D3
			{"◇",		"$ff" },	// U+25c7	// j68
			{"⧗",		"$ff" },	// U+29D7
			{NULL,		NULL },
		};

char	*
escape_bmchar(char *str)
{
	char	*buf = calloc(1,2000);
	char	*bp = buf;
	char	*p = str;
	int		in = -1;			// escape mode?
	char	*FCB="\tFCB\t";
	char	*FCC="\tFCC\t'";

	while(*p){
		if(bp-buf>1000){ goto toolong; }
		if(*p=='\'' || *p=='\\' || *p==0x7F){
			if(in==-1) {
				in = 1;
				memcpy(bp,FCB,strlen(FCB));
				bp+=strlen(FCB);
			}else if(in==0){
				*bp++ = '\n';
				memcpy(bp,FCB,strlen(FCB));
				bp+=strlen(FCB);
				in = 1;
			}else if(in==1){
				if(bp-buf>1000){ goto toolong; }
				*bp++ = ',';
			}
			char s[10];
			sprintf(s,"$%02x",*p++);
			memcpy(bp,s,strlen(s));
			bp+=strlen(s);
		}else if(*p>=0x20 && *p<=0x7E){				// ASCII
			if(in==-1) {
				memcpy(bp,FCC,strlen(FCC));
				bp+=strlen(FCC);
				in = 0;
			}else if(in==1){
				*bp++='\n';
				memcpy(bp,FCC,strlen(FCC));
				bp+=strlen(FCC);
				in = 0;
			}
			if(bp-buf>1000){ goto toolong; }
			*bp++ = *p++;
			continue;
		}else{									// not ASCII, escape it!
			if(in==-1) {
				memcpy(bp,FCB,strlen(FCB));
				bp+=strlen(FCB);
				in = 1;
			}else if(in==0){
				*bp++ = '\'';
				*bp++ = '\n';
				memcpy(bp,FCB,strlen(FCB));
				bp+=strlen(FCB);
				in = 1;
			}else if(in==1){
				if(bp-buf>1000){ goto toolong; }
				*bp++ = ',';
			}
			int i=0;
			for(i=0; table[i].from!=NULL; i++) {
				if(memcmp(p,table[i].from,strlen(table[i].from))==0) {	// 変換する
					memcpy(bp,table[i].to,strlen(table[i].to));
					p+=strlen(table[i].from);
					bp+=strlen(table[i].to);
					break;
				}
			}
			if(table[i].from==NULL){
				error("; convert error");
			}
		}
	}
	if(in==0){
		*bp++ = '\'';
		*bp++ = '\n';
	}else if(in==1){
		*bp++ = '\n';
	}
	return buf;
toolong:
	*bp='\0';
	error("; too long string. what? '%s'\n",buf);
	return buf;
}
